html/transactivos.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-07-05 Tue 18:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>transactivos</title>
<meta name="author" content="Ketan Agrawal" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="syntax.css" />
<link rel="stylesheet" type="text/css" href="styles.css" />
<link rel="apple-touch-icon" sizes="180x180" href="/apple-touch-icon.png" />
<link rel="icon" type="image/png" sizes="32x32" href="/favicon-32x32.png" />
<link rel="icon" type="image/png" sizes="16x16" href="/favicon-16x16.png" />
<link rel="manifest" href="/site.webmanifest" />
</head>
<body>
<div id="preamble" class="status">
<header>
    <script src="setup-initial-theme.js"></script>
    <div style="display: flex; flex-direction: row; justify-content: space-between; align-items: center;">
        <a style="color: inherit; text-decoration: none" href="/">
            <svg id="nebula-logo" x="0px" y="0px" width="50px"
                 viewBox="0 0 290.513 290.513" style="enable-background:new 0 0 290.513 290.513;" xml:space="preserve">
                <g>
                    <g>
                        <path d="M168.684,103.086c-58.679,0-93.713,17.515-93.713,46.857c0,18.344,27.214,28.114,46.857,28.114
                                 c46.327,0,46.857-22.472,46.857-23.428l-9.367-0.141c-0.009,0.141-1.354,14.198-37.49,14.198
                                 c-16.976,0-37.485-8.359-37.485-18.743c0-23.124,32.317-37.485,84.342-37.485c68.312,0,112.456,20.233,112.456,51.542
                                 c0,32.818-50.989,70.252-145.49,74.975l0.469,9.357c101.36-5.065,154.393-46.262,154.393-84.333
                                 C290.511,126.996,242.689,103.086,168.684,103.086z"/>
                        <path d="M215.541,154.628c0-18.344-27.214-28.114-46.857-28.114c-46.327,0-46.857,22.472-46.857,23.428
                                 l9.367,0.141c0.009-0.141,1.354-14.198,37.49-14.198c16.976,0,37.485,8.359,37.485,18.743c0,23.124-32.317,37.485-84.342,37.485
                                 c-68.312,0-112.456-20.233-112.456-51.542c0-32.818,50.989-70.252,145.49-74.975l-0.469-9.357C53.032,61.303,0,102.5,0,140.571
                                 c0,37.003,47.822,60.914,121.827,60.914C180.506,201.485,215.541,183.97,215.541,154.628z"/>
                        <path d="M51.542,107.771c0,7.75-6.307,14.057-14.057,14.057v9.371c7.75,0,14.057,6.307,14.057,14.057h9.371
                                 c0-7.75,6.307-14.057,14.057-14.057v-9.371c-7.75,0-14.057-6.307-14.057-14.057H51.542z M56.228,131.214
                                 c-1.335-1.776-2.919-3.364-4.7-4.7c1.781-1.335,3.364-2.924,4.7-4.7c1.335,1.776,2.919,3.364,4.7,4.7
                                 C59.147,127.849,57.563,129.438,56.228,131.214z"/>
                        <path d="M238.969,187.428h9.371c0-10.337,8.406-18.743,18.743-18.743v-9.371
                                 c-10.337,0-18.743-8.406-18.743-18.743h-9.371c0,10.337-8.406,18.743-18.743,18.743v9.371
                                 C230.563,168.685,238.969,177.091,238.969,187.428z M243.655,156.095c2.08,3.13,4.775,5.82,7.905,7.905
                                 c-3.13,2.08-5.82,4.775-7.905,7.905c-2.08-3.13-4.775-5.82-7.905-7.905C238.88,161.919,241.574,159.225,243.655,156.095z"/>
                        <path d="M103.085,206.17h-9.371c0,10.337-8.406,18.743-18.743,18.743v9.371
                                 c10.337,0,18.743,8.406,18.743,18.743h9.371c0-10.337,8.406-18.743,18.743-18.743v-9.371
                                 C111.491,224.913,103.085,216.507,103.085,206.17z M98.399,237.503c-2.08-3.13-4.775-5.82-7.905-7.905
                                 c3.13-2.08,5.82-4.775,7.905-7.905c2.08,3.13,4.775,5.82,7.905,7.905C103.174,231.679,100.479,234.373,98.399,237.503z"/>
                        <path d="M182.741,84.343h9.371c0-10.337,8.406-18.743,18.743-18.743v-9.371
                                 c-10.337,0-18.743-8.406-18.743-18.743h-9.371c0,10.337-8.406,18.743-18.743,18.743V65.6
                                 C174.335,65.6,182.741,74.006,182.741,84.343z M187.427,53.01c2.08,3.13,4.775,5.82,7.905,7.905
                                 c-3.13,2.08-5.82,4.775-7.905,7.905c-2.08-3.13-4.775-5.82-7.905-7.905C182.652,58.834,185.346,56.14,187.427,53.01z"/>
                        <rect x="98.399" y="135.885" width="9.371" height="9.371"/>
                        <rect x="107.77" y="149.942" width="9.371" height="9.371"/>
                        <rect x="168.684" y="168.685" width="9.371" height="9.371"/>
                        <rect x="182.741" y="145.257" width="9.371" height="9.371"/>
		                    <rect x="215.541" y="187.428" width="9.371" height="9.371"/>
		                    <rect x="154.627" y="215.542" width="9.371" height="9.371"/>
	                  </g>
                </g>
            </svg>
        </a>
        <div>
            <input type="checkbox" id="theme-switcher">
            <label id="theme-switcher-label" for="theme-switcher"></label>
        </div>
    </div>
</header>
</div>
<div id="content" class="content">
<h1 class="title">transactivos
<br />
<span class="subtitle">Last modified on July 05, 2022</span>
</h1>
<p>
Meeting with Gui, Breno, and Karn on July 5th, 2022.<br />
</p>

<div id="outline-container-org62c14ea" class="outline-2">
<h2 id="org62c14ea">Conversational threads</h2>
<div class="outline-text-2" id="text-org62c14ea">
</div>
<div id="outline-container-orgef658f1" class="outline-3">
<h3 id="orgef658f1">About me (filtered for this convo)</h3>
<div class="outline-text-3" id="text-orgef658f1">
<ul class="org-ul">
<li>2016-ish: really interested in structures of all kinds<br /></li>
<li>2017-ish: discovered Symbolic Systems at Stanford - felt that it called to me.<br /></li>
<li>Turing Test /  <a href="why_people_think_computers_cant.html#ID-b7e233f7-62f3-408f-9244-3d486a1e847d">Why People Think Computers Can&rsquo;t</a>: seminal moment for me in thinking about the nature of intelligence (related to <a href="#ID-c0cd7676-3ef5-4cb8-8ab9-f351f3ce3dc7">What the fuck is &ldquo;cognition&rdquo; after all?</a>)<br />
<ul class="org-ul">
<li>studying artificial intelligence was an outgrowth of this inspirational moment<br /></li>
</ul></li>
<li>2018-ish: had the idea for Thoughtset &#x2013; being able to subset my thoughts in various ways<br />
treating each thought as an &ldquo;atom&rdquo; &#x2013; can collect the atoms in different organizations<br />
<ul class="org-ul">
<li>didn&rsquo;t quite have the technical skills to express it yet<br /></li>
</ul></li>
<li>2019-ish: got very into vim, keyboard shortcuts, &ldquo;system config&rdquo; kind of stuff&#x2013; crazy how vim keybindings become subconscious after a certain point 🤯<br /></li>
<li>2020-ish: became aware of roam / org-roam, becoming (more) interested in knowledge graphs, etc.<br />
<ul class="org-ul">
<li>interest in <a href="private/20200406044025-knowledge_graphp.html#ID-40ab35a4-500b-4724-bd65-eb4e0b0b02b6">knowledge graph</a>s, <a href="private/20200327142635_emacs.html#ID-79c8e056-1bea-44c8-8a43-66292cf0bd48">emacs</a>, <a href="system.html#ID-4ca02697-506c-4910-bf5e-ce8dcb2da5a5">systems</a>, all started to intertwine in this COVID era<br /></li>
</ul></li>
<li>2022-ish: meeting Gui, reading Designing Freedom, becoming aware of the societal perspective on systems. or the systems perspective on society?<br /></li>
<li>future:<br />
<ul class="org-ul">
<li>integrating the cybernetics / societal systems perspective that Gui has exposed me to into my work. working to create structures that increase individual freedom<br /></li>
<li>who knows&#x2026;?<br /></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgfbd6faa" class="outline-3">
<h3 id="orgfbd6faa">&ldquo;What is cognition?&rdquo; from a cognitive science perspective.</h3>
<div class="outline-text-3" id="text-orgfbd6faa">
<p>
Mostly inspired by <i>Other Minds</i> by Peter Godfrey-Smith, Chapter 2: A History of Animals.<br />
</p>

<p>
Nervous system is a very <i>costly</i> machine &#x2013; why do we have one in the first place? two schools:<br />
</p>
</div>
<div id="outline-container-org103fb13" class="outline-4">
<h4 id="org103fb13">School 1: Sensorimotor view of nervous system</h4>
<div class="outline-text-4" id="text-org103fb13">
<p>
The nervous system &ldquo;bridges the gap&rdquo; between perception and action.<br />
</p>
</div>
</div>
<div id="outline-container-org2b44c5c" class="outline-4">
<h4 id="org2b44c5c">School 2: Coordination view of nervous system</h4>
<div class="outline-text-4" id="text-org2b44c5c">
<p>
We are big, multicellular, multi-system beings. It takes a powerful nervous system to coordinate all of those things<br />
~ the thousands of &ldquo;micro-actions&rdquo; =&gt; &ldquo;macro-actions&rdquo;<br />
</p>
</div>
</div>
<div id="outline-container-org13ca476" class="outline-4">
<h4 id="org13ca476">Each frame has its merits &#x2013; but perhaps the first frame has been too dominant in cognitive science (and society at large.) viewing us behavioristically, as input-output mechansisms</h4>
<div class="outline-text-4" id="text-org13ca476">
<p>
This coordination piece is important &#x2013; and if we view our internal cognition as analogous to social cognition, then the coordination piece needs to be solved both on an individual level and a societal level.<br />
</p>
</div>
</div>
</div>
<div id="outline-container-org61bfa2e" class="outline-3">
<h3 id="org61bfa2e"><a href="private/20201111010429-digital_laboratory.html#ID-def74678-76b6-4eae-9908-4a82bad04a0b">🌌 digital nebula</a> as a way of &ldquo;pinching&rdquo; certain threads in my knowledge graph</h3>
<div class="outline-text-3" id="text-org61bfa2e">
<p>
Just the tip of the iceberg in terms of what is possible &#x2013; methods of organization of our thoughts, our knowledge. This is like a prototype of a prototype.<br />
</p>

<p>
technology is imperfect, we&rsquo;re not always capable of <a href="expression.html#ID-1bdb5bd1-008d-4308-874b-801f25c4a393">expressing</a> things that we want to express - have to work within current systems (org-roam, Roam, Anki, etc.) that enable certain modes of expression.<br />
</p>

<p>
It&rsquo;s not so much about the tool, but how you use it (and if you use it at all! A system that is not used (consistently) isn&rsquo;t very useful)<br />
</p>
<blockquote class="quoteback" data-title="Augmenting Long-term Memory" data-author="Michael Nielsen" cite="http://augmentingcognition.com/ltm.html#:~:text=95%25%20of%20anki's%20value%20comes%20from%205%25%20of%20the%20features">
<p>
95% of Anki&rsquo;s value comes from 5% of the features<br />
</p>
<footer>Michael Nielsen<cite><a href="http://augmentingcognition.com/ltm.html#:~:text=95%25%20of%20anki's%20value%20comes%20from%205%25%20of%20the%20features">http://augmentingcognition.com/ltm.html#:~:text=95%25%20of%20anki's%20value%20comes%20from%205%25%20of%20the%20features</a></cite></footer></blockquote><script note="" src="https://cdn.jsdelivr.net/gh/Blogger-Peer-Review/quotebacks@1/quoteback.js"></script>
</div>
</div>
<div id="outline-container-org9edc57a" class="outline-3">
<h3 id="org9edc57a">uneven distribution of technologies</h3>
<div class="outline-text-3" id="text-org9edc57a">
<p>
[open to convo]<br />
</p>
</div>
</div>
<div id="outline-container-org8dca87c" class="outline-3">
<h3 id="org8dca87c">drafting vs. publishing stacks</h3>
<div class="outline-text-3" id="text-org8dca87c">
<p>
Seems like the tools for ideation and publishing / conveying to others effectively are quite different.<br />
</p>

<p>
Current solution (for me) = using org-mode, publishing to HTML, etc&#x2026;&ldquo;forever draft&rdquo; = basically what it is<br />
</p>

<p>
But it&rsquo;d be nice to have &ldquo;finished&rdquo; pieces too. I can talk a bit about what I <i>want</i> this space to turn into, which is less effective than what it actually is &#x2013; but I don&rsquo;t just necessarily want my digital garden to be a random grab-bag of stuff. I&rsquo;d appreciate if some stuff was &ldquo;finished,&rdquo; &ldquo;coherent,&rdquo; &ldquo;understandable.&rdquo; I guess it&rsquo;s different needs for different things. Notes for myself don&rsquo;t need to be &rsquo;finished&rsquo; per se&#x2026;but a blog post, or a book written for other people does have some finality to it&#x2026;<br />
</p>

<p>
question: is &ldquo;forever draft&rdquo; a good thing?<br />
</p>
</div>
</div>
<div id="outline-container-org1a3b311" class="outline-3">
<h3 id="org1a3b311"><a href="shortcuts.html#ID-058bef0b-aba6-4ac6-b4ae-b3c7b7e22040">⤴️ shortcuts</a> as a worm that has eaten into my habits</h3>
<div class="outline-text-3" id="text-org1a3b311">
<p>
Not sure whether they&rsquo;re good or bad, but they&rsquo;re powerful, that&rsquo;s all I&rsquo;ll say. Reducing the friction to certain actions that I find favorable, to the point where I do them subconsciously, is powerful.<br />
</p>
</div>
</div>
<div id="outline-container-org0118de2" class="outline-3">
<h3 id="org0118de2"><a href="spaced_repetition.html#ID-3e676e0c-65d7-44ee-9886-324b82878b28">🔁  spaced repetition</a>: how to intentionally remember things</h3>
<div class="outline-text-3" id="text-org0118de2">
<p>
can be a Anki-style system, a la <a href="augmenting_long_term_memory.html#ID-80f83e7d-cd8b-4eeb-b8c1-ab8258340c78">Augmenting Long-term Memory</a><br />
</p>

<p>
can be a system like this &#x2013; node&rsquo;s degree is rough proxy for how much it should be repeated / traversed<br />
connectivity is very important, in this frame.<br />
</p>
</div>
</div>
<div id="outline-container-org7f38f6e" class="outline-3">
<h3 id="org7f38f6e">🎒 Random grab-bag of stuff I&rsquo;ve been thinking about recently:</h3>
<div class="outline-text-3" id="text-org7f38f6e">
</div>
<div id="outline-container-org07f4d20" class="outline-4">
<h4 id="org07f4d20">Was the cognitive, day-to-day experience of living in the early 2000s a lot different than now? (In other words, how did smartphones (as opposed to personal computers / Internet) change the thought patterns of an entire civilization?)</h4>
<div class="outline-text-4" id="text-org07f4d20">
<p>
specifically angling towards the focusing / attention aspects of cognition&#x2026;<br />
</p>

<ul class="org-ul">
<li>phone feels like an extension of my body, a weak form of brain-computer interface<br /></li>
<li>hesitate to immediately jump to a &ldquo;good changes&rdquo; / &ldquo;bad changes&rdquo; frame<br /></li>
<li>I am &ldquo;close&rdquo; to lots, lots more knowledge than before - friction to connect with people over the Internet is much lower<br />
<ul class="org-ul">
<li>don&rsquo;t have to boot up a desktop computer to talk to people - more like, oh, let&rsquo;s see what other people are saying in my pocket, or on my wrist<br /></li>
</ul></li>
<li>probably has changed dopamine / reward circuitry a lot<br />
<ul class="org-ul">
<li>lots of stimulating content available to us &#x2013; crave that kind of content<br /></li>
<li>shortening attention spans<br /></li>
</ul></li>
</ul>
</div>
<ul class="org-ul">
<li><a id="org81bc403"></a>Follow-up question: how can we redesign technology in a way that makes us more thoughtful / attentive / able to follow threads deeply, without getting distracted?<br />
<div class="outline-text-5" id="text-org81bc403">
<ul class="org-ul">
<li>notifications seem like they have a huge effect on attention: how could those systems be redesigned (but we still get notified of important things at appropriate times?)<br /></li>
</ul>
</div>
</li>
</ul>
</div>
<div id="outline-container-orga63a26b" class="outline-4">
<h4 id="orga63a26b">how can we use software to modulate our <a href="attention.html#ID-2e1955ad-af09-4bcd-8b8d-4a0838e96365">attention</a> to various things?</h4>
<div class="outline-text-4" id="text-orga63a26b">
</div>
<ul class="org-ul">
<li><a id="org44d1b3a"></a>Nota: flashes the point which you jumped to<br /></li>
</ul>
</div>
<div id="outline-container-org88d01b7" class="outline-4">
<h4 id="org88d01b7">a family (or other social organizational unit) - greater than the sum of its parts. the relationships / interactions between the nodes are very important in reinforcing the emergent concept of &ldquo;family&rdquo;</h4>
<div class="outline-text-4" id="text-org88d01b7">
<p>
Interesting to note cultural differences: girlfriend is Tamil, and the family bonds are very strong (calling/texting parents every day / nearly every day,) whereas I communicate with my parents about once a week on average&#x2026;structures that are very divergent in their interactions can still be called a &ldquo;family&rdquo;&#x2026;<br />
</p>
</div>
</div>
<div id="outline-container-org7ac829c" class="outline-4">
<h4 id="org7ac829c">two discrete activities: programming and using a program&#x2026;.</h4>
<div class="outline-text-4" id="text-org7ac829c">
<p>
Related to what Karn was saying about the uneven distribution of technologies, and what sorts of control an individual has over their computer&#x2026;<br />
</p>

<p>
Ultimately, this is just a frame on what we&rsquo;re doing with computers. We&rsquo;re all manipulating state of computers &#x2013; but only <i>some</i> of us know how to pull certain marionette strings within the computer to make it do certain things&#x2026;<br />
</p>

<p>
maybe we can seek to, a la end-user programming, blur the distinction between these two things?<br />
</p>

<p>
interesting, and maybe esoteric connection: person who doesn&rsquo;t have the pre-requisite knowledge/skills to be an artist can use DALL-E. DALL-E blurs the line between programming and using a program. the &ldquo;puppet fingers&rdquo; are more extensive. Could we use DALL-E as a model of how end-users can be afforded more control, in an input language they understand? (GRANTED: still mostly elites using DALL-E, so the irony is not lost on me, lol.)<br />
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org0a112c4" class="outline-2">
<h2 id="org0a112c4">Conversation</h2>
<div class="outline-text-2" id="text-org0a112c4">
</div>
<div id="outline-container-ID-c0cd7676-3ef5-4cb8-8ab9-f351f3ce3dc7" class="outline-3">
<h3 id="ID-c0cd7676-3ef5-4cb8-8ab9-f351f3ce3dc7">What the fuck is &ldquo;cognition&rdquo; after all?</h3>
<div class="outline-text-3" id="text-org005068b">
</div>

<div id="outline-container-orgcbcb4a5" class="outline-4 references">
<h4 id="orgcbcb4a5">Links to &ldquo;What the fuck is &rdquo;cognition&ldquo; after all?&rdquo;</h4>
<div class="outline-text-4" id="text-orgcbcb4a5">
</div>
<ul class="org-ul">
<li><a id="orged9f14b"></a><a href="transactivos.html#ID-b82054c7-06f7-4f4b-a547-68e637468ed7">transactivos</a> <span class="backlinks-outline-path">(<i>Conversational threads &gt; About me (filtered for this convo)</i>)</span><br />
<div class="outline-text-5" id="text-orged9f14b">
<ul class="org-ul">
<li>2016-ish: really interested in structures of all kinds<br /></li>
<li>2017-ish: discovered Symbolic Systems at Stanford - felt that it called to me.<br /></li>
<li>Turing Test /  <a href="why_people_think_computers_cant.html#ID-b7e233f7-62f3-408f-9244-3d486a1e847d">Why People Think Computers Can&rsquo;t</a>: seminal moment for me in thinking about the nature of intelligence (related to <a href="#ID-c0cd7676-3ef5-4cb8-8ab9-f351f3ce3dc7">What the fuck is &ldquo;cognition&rdquo; after all?</a>)<br />
<ul class="org-ul">
<li>studying artificial intelligence was an outgrowth of this inspirational moment<br /></li>
</ul></li>
<li>2018-ish: had the idea for Thoughtset &#x2013; being able to subset my thoughts in various ways<br />
treating each thought as an &ldquo;atom&rdquo; &#x2013; can collect the atoms in different organizations<br />
<ul class="org-ul">
<li>didn&rsquo;t quite have the technical skills to express it yet<br /></li>
</ul></li>
<li>2019-ish: got very into vim, keyboard shortcuts, &ldquo;system config&rdquo; kind of stuff&#x2013; crazy how vim keybindings become subconscious after a certain point 🤯<br /></li>
<li>2020-ish: became aware of roam / org-roam, becoming (more) interested in knowledge graphs, etc.<br />
<ul class="org-ul">
<li>interest in <a href="private/20200406044025-knowledge_graphp.html#ID-40ab35a4-500b-4724-bd65-eb4e0b0b02b6">knowledge graph</a>s, <a href="private/20200327142635_emacs.html#ID-79c8e056-1bea-44c8-8a43-66292cf0bd48">emacs</a>, <a href="system.html#ID-4ca02697-506c-4910-bf5e-ce8dcb2da5a5">systems</a>, all started to intertwine in this COVID era<br /></li>
</ul></li>
<li>2022-ish: meeting Gui, reading Designing Freedom, becoming aware of the societal perspective on systems. or the systems perspective on society?<br /></li>
<li>future:<br />
<ul class="org-ul">
<li>integrating the cybernetics / societal systems perspective that Gui has exposed me to into my work. working to create structures that increase individual freedom<br /></li>
<li>who knows&#x2026;?<br /></li>
</ul></li>
</ul>
</div>
</li>
</ul>
</div>
</div>


<div id="outline-container-ID-9246fd69-bc7a-44b2-bb97-6c0913306fc4" class="outline-3">
<h3 id="ID-9246fd69-bc7a-44b2-bb97-6c0913306fc4">In what ways do you feel you are enhancing your own cognition?</h3>
<div class="outline-text-3" id="text-org9d88512">
</div>
</div>
<div id="outline-container-ID-9739a88a-1058-44d0-baf4-940536416ac5" class="outline-3">
<h3 id="ID-9739a88a-1058-44d0-baf4-940536416ac5">(Meta-question) What are some tools for improving transactivos&rsquo; shared cognition?</h3>
<div class="outline-text-3" id="text-org79fa4ae">
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer>
  <p>Made with <span class="heart">♥</span> using
    <a href="https://orgmode.org/">org-mode</a>.
    Source code is available
    <a href="https://github.com/ketan0/digital-laboratory">here</a>.
  </p>
</footer>
<script src="popper.min.js"></script>
<script src="tippy-bundle.umd.min.js"></script>
<script src="tooltips.js"></script>
<script src="setup-theme-switcher.js"></script>
<script src="insert-intext-citation.js"></script>
</div>
</body>
</html>
